[Killed] ConditionalExpression
src/books/books.service.ts:13:9
   async findAll(filters?: BookFilters): Promise<Book[]> {
     const where: any = {};
 
-    if (filters?.genre) {
+    if (false) {
       where.genre = filters.genre;
     }
killedBy: BooksService findAll should apply genre filter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "orderBy": Object {
      "title": "asc",

[Killed] BlockStatement
src/books/books.service.ts:13:25
   async findAll(filters?: BookFilters): Promise<Book[]> {
     const where: any = {};
 
-    if (filters?.genre) {
-      where.genre = filters.genre;
-    }
+    if (filters?.genre) {}
 
     if (filters?.search) {
killedBy: BooksService findAll should apply genre filter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "orderBy": Object {
      "title": "asc",

[Killed] BlockStatement
src/books/books.service.ts:17:26
       where.genre = filters.genre;
     }
 
-    if (filters?.search) {
-      const search = filters.search.toLowerCase();
-      where.OR = [
-        { title: { contains: search, mode: 'insensitive' } },
-        { author: { contains: search, mode: 'insensitive' } },
-      ];
-    }
+    if (filters?.search) {}
 
     if (filters?.minPrice !== undefined || filters?.maxPrice !== undefined) {
killedBy: BooksService findAll should apply search filter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "orderBy": Object {
      "title": "asc",

[Killed] ConditionalExpression
src/books/books.service.ts:17:9
       where.genre = filters.genre;
     }
 
-    if (filters?.search) {
+    if (false) {
       const search = filters.search.toLowerCase();
       where.OR = [
killedBy: BooksService findAll should apply search filter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "orderBy": Object {
      "title": "asc",

[Killed] MethodExpression
src/books/books.service.ts:18:22
     }
 
     if (filters?.search) {
-      const search = filters.search.toLowerCase();
+      const search = filters.search.toUpperCase();
       where.OR = [
         { title: { contains: search, mode: 'insensitive' } },
killedBy: BooksService findAll should apply search filter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,17 +4,17 @@
    },
    "where": Object {

[Killed] ArrayDeclaration
src/books/books.service.ts:19:18
 
     if (filters?.search) {
       const search = filters.search.toLowerCase();
-      where.OR = [
-        { title: { contains: search, mode: 'insensitive' } },
-        { author: { contains: search, mode: 'insensitive' } },
-      ];
+      where.OR = [];
     }
 
killedBy: BooksService findAll should apply search filter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "orderBy": Object {
      "title": "asc",

[Killed] BlockStatement
src/books/books.service.ts:25:77
       ];
     }
 
-    if (filters?.minPrice !== undefined || filters?.maxPrice !== undefined) {
-      where.price = {};
-      if (filters.minPrice !== undefined && filters.minPrice !== null) {
-        where.price.gte = Math.floor(filters.minPrice);
-      }
-      if (filters.maxPrice !== undefined && filters.maxPrice !== null) {
-        where.price.lte = Math.floor(filters.maxPrice);
-      }
-    }
+    if (filters?.minPrice !== undefined || filters?.maxPrice !== undefined) {}
 
     const books = await this.prisma.book.findMany({
killedBy: BooksService findAll should apply price filter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "orderBy": Object {
      "title": "asc",

[Killed] ConditionalExpression
src/books/books.service.ts:25:9
       ];
     }
 
-    if (filters?.minPrice !== undefined || filters?.maxPrice !== undefined) {
+    if (true) {
       where.price = {};
       if (filters.minPrice !== undefined && filters.minPrice !== null) {
killedBy: BooksService findAll should return an array of books
statusReason: TypeError: Cannot read properties of undefined (reading 'minPrice')

[Killed] BlockStatement
src/books/books.service.ts:27:72
 
     if (filters?.minPrice !== undefined || filters?.maxPrice !== undefined) {
       where.price = {};
-      if (filters.minPrice !== undefined && filters.minPrice !== null) {
-        where.price.gte = Math.floor(filters.minPrice);
-      }
+      if (filters.minPrice !== undefined && filters.minPrice !== null) {}
       if (filters.maxPrice !== undefined && filters.maxPrice !== null) {
         where.price.lte = Math.floor(filters.maxPrice);
killedBy: BooksService findAll should apply price filter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,10 +2,9 @@
    "orderBy": Object {
      "title": "asc",

[Killed] LogicalOperator
src/books/books.service.ts:27:11
 
     if (filters?.minPrice !== undefined || filters?.maxPrice !== undefined) {
       where.price = {};
-      if (filters.minPrice !== undefined && filters.minPrice !== null) {
+      if (filters.minPrice !== undefined || filters.minPrice !== null) {
         where.price.gte = Math.floor(filters.minPrice);
       }
killedBy: BooksService findAll should apply only maxPrice filter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,9 +2,10 @@
    "orderBy": Object {
      "title": "asc",

[Killed] EqualityOperator
src/books/books.service.ts:30:45
       if (filters.minPrice !== undefined && filters.minPrice !== null) {
         where.price.gte = Math.floor(filters.minPrice);
       }
-      if (filters.maxPrice !== undefined && filters.maxPrice !== null) {
+      if (filters.maxPrice !== undefined && filters.maxPrice === null) {
         where.price.lte = Math.floor(filters.maxPrice);
       }
killedBy: BooksService findAll should apply price filter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -3,9 +3,8 @@
      "title": "asc",
    },

[Killed] ConditionalExpression
src/books/books.service.ts:30:11
       if (filters.minPrice !== undefined && filters.minPrice !== null) {
         where.price.gte = Math.floor(filters.minPrice);
       }
-      if (filters.maxPrice !== undefined && filters.maxPrice !== null) {
+      if (true) {
         where.price.lte = Math.floor(filters.maxPrice);
       }
killedBy: BooksService findAll should apply only minPrice filter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -3,8 +3,9 @@
      "title": "asc",
    },

[Killed] ObjectLiteral
src/books/books.service.ts:35:51
       }
     }
 
-    const books = await this.prisma.book.findMany({
-      where,
-      orderBy: { title: 'asc' },
-    });
+    const books = await this.prisma.book.findMany({});
 
     return books;
killedBy: BooksService findAll should return an array of books
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "orderBy": Object {
-     "title": "asc",

[Killed] BlockStatement
src/books/books.service.ts:43:56
     return books;
   }
 
-  async findOne(id: string): Promise<Book | undefined> {
-    const book = await this.prisma.book.findUnique({ where: { id } });
-    return book || undefined;
-  }
+  async findOne(id: string): Promise<Book | undefined> {}
 
   async getGenres(): Promise<string[]> {
killedBy: BooksService findOne should return a book if found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"id": "1", "title": "Test Book"}
Received: undefined

[Killed] LogicalOperator
src/books/books.service.ts:45:12
 
   async findOne(id: string): Promise<Book | undefined> {
     const book = await this.prisma.book.findUnique({ where: { id } });
-    return book || undefined;
+    return book && undefined;
   }
 
killedBy: BooksService findOne should return a book if found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"id": "1", "title": "Test Book"}
Received: undefined

[Killed] ConditionalExpression
src/books/books.service.ts:45:12
 
   async findOne(id: string): Promise<Book | undefined> {
     const book = await this.prisma.book.findUnique({ where: { id } });
-    return book || undefined;
+    return false;
   }
 
killedBy: BooksService findOne should return a book if found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"id": "1", "title": "Test Book"}
Received: false

[Killed] BlockStatement
src/books/books.service.ts:48:40
     return book || undefined;
   }
 
-  async getGenres(): Promise<string[]> {
-    const genres = await this.prisma.book.findMany({
-      select: { genre: true },
-      distinct: ['genre'],
-      orderBy: { genre: 'asc' },
-    });
-    return genres.map((g: { genre: string }) => g.genre);
-  }
+  async getGenres(): Promise<string[]> {}
 }
 
killedBy: BooksService getGenres should return an array of genres
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["Fiction", "Non-Fiction"]
Received: undefined

[Killed] BooleanLiteral
src/books/books.service.ts:50:24
 
   async getGenres(): Promise<string[]> {
     const genres = await this.prisma.book.findMany({
-      select: { genre: true },
+      select: { genre: false },
       distinct: ['genre'],
       orderBy: { genre: 'asc' },
killedBy: BooksService getGenres should return an array of genres
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,8 +4,8 @@
    ],
    "orderBy": Object {

[Killed] ArrowFunction
src/books/books.service.ts:54:23
       distinct: ['genre'],
       orderBy: { genre: 'asc' },
     });
-    return genres.map((g: { genre: string }) => g.genre);
+    return genres.map(() => undefined);
   }
 }
killedBy: BooksService getGenres should return an array of genres
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "Fiction",
-   "Non-Fiction",
