[Killed] BlockStatement
src/books/books.service.ts:48:40
     return book || undefined;
   }
 
-  async getGenres(): Promise<string[]> {
-    const genres = await this.prisma.book.findMany({
-      select: { genre: true },
-      distinct: ['genre'],
-      orderBy: { genre: 'asc' },
-    });
-    return genres.map((g) => g.genre);
-  }
+  async getGenres(): Promise<string[]> {}
 }
 
killedBy: BooksService getGenres should return an array of genres
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["Fiction", "Non-Fiction"]
Received: undefined

[Killed] ArrowFunction
src/books/books.service.ts:54:23
       distinct: ['genre'],
       orderBy: { genre: 'asc' },
     });
-    return genres.map((g) => g.genre);
+    return genres.map(() => undefined);
   }
 }
killedBy: BooksService getGenres should return an array of genres
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "Fiction",
-   "Non-Fiction",
